MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2480/mcu.h
// Register: TXB2D3
#define TXB2D3 TXB2D3
extern volatile unsigned char           TXB2D3              __at(0xF29);
#ifndef _LIB_BUILD
asm("TXB2D3 equ 0F29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D30                :1;
        unsigned TXB2D31                :1;
        unsigned TXB2D32                :1;
        unsigned TXB2D33                :1;
        unsigned TXB2D34                :1;
        unsigned TXB2D35                :1;
        unsigned TXB2D36                :1;
        unsigned TXB2D37                :1;
    };
} TXB2D3bits_t;
extern volatile TXB2D3bits_t TXB2D3bits __at(0xF29);
// bitfield macros
#define _TXB2D3_TXB2D30_POSN                                0x0
#define _TXB2D3_TXB2D30_POSITION                            0x0
#define _TXB2D3_TXB2D30_SIZE                                0x1
#define _TXB2D3_TXB2D30_LENGTH                              0x1
#define _TXB2D3_TXB2D30_MASK                                0x1
#define _TXB2D3_TXB2D31_POSN                                0x1
#define _TXB2D3_TXB2D31_POSITION                            0x1
#define _TXB2D3_TXB2D31_SIZE                                0x1
#define _TXB2D3_TXB2D31_LENGTH                              0x1
#define _TXB2D3_TXB2D31_MASK                                0x2
#define _TXB2D3_TXB2D32_POSN                                0x2
#define _TXB2D3_TXB2D32_POSITION                            0x2
#define _TXB2D3_TXB2D32_SIZE                                0x1
#define _TXB2D3_TXB2D32_LENGTH                              0x1
#define _TXB2D3_TXB2D32_MASK                                0x4
#define _TXB2D3_TXB2D33_POSN                                0x3
#define _TXB2D3_TXB2D33_POSITION                            0x3
#define _TXB2D3_TXB2D33_SIZE                                0x1
#define _TXB2D3_TXB2D33_LENGTH                              0x1
#define _TXB2D3_TXB2D33_MASK                                0x8
#define _TXB2D3_TXB2D34_POSN                                0x4
#define _TXB2D3_TXB2D34_POSITION                            0x4
#define _TXB2D3_TXB2D34_SIZE                                0x1
#define _TXB2D3_TXB2D34_LENGTH                              0x1
#define _TXB2D3_TXB2D34_MASK                                0x10
#define _TXB2D3_TXB2D35_POSN                                0x5
#define _TXB2D3_TXB2D35_POSITION                            0x5
#define _TXB2D3_TXB2D35_SIZE                                0x1
#define _TXB2D3_TXB2D35_LENGTH                              0x1
#define _TXB2D3_TXB2D35_MASK                                0x20
#define _TXB2D3_TXB2D36_POSN                                0x6
#define _TXB2D3_TXB2D36_POSITION                            0x6
#define _TXB2D3_TXB2D36_SIZE                                0x1
#define _TXB2D3_TXB2D36_LENGTH                              0x1
#define _TXB2D3_TXB2D36_MASK                                0x40
#define _TXB2D3_TXB2D37_POSN                                0x7
#define _TXB2D3_TXB2D37_POSITION                            0x7
#define _TXB2D3_TXB2D37_SIZE                                0x1
#define _TXB2D3_TXB2D37_LENGTH                              0x1
#define _TXB2D3_TXB2D37_MASK                                0x80

// Register: TXB2D4
#define TXB2D4 TXB2D4
extern volatile unsigned char           TXB2D4              __at(0xF2A);
#ifndef _LIB_BUILD
asm("TXB2D4 equ 0F2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D40                :1;
        unsigned TXB2D41                :1;
        unsigned TXB2D42                :1;
        unsigned TXB2D43                :1;
        unsigned TXB2D44                :1;
        unsigned TXB2D45                :1;
        unsigned TXB2D46                :1;
        unsigned TXB2D47                :1;
    };
} TXB2D4bits_t;
extern volatile TXB2D4bits_t TXB2D4bits __at(0xF2A);
// bitfield macros
#define _TXB2D4_TXB2D40_POSN                                0x0
#define _TXB2D4_TXB2D40_POSITION                            0x0
#define _TXB2D4_TXB2D40_SIZE                                0x1
#define _TXB2D4_TXB2D40_LENGTH                              0x1
#define _TXB2D4_TXB2D40_MASK                                0x1
#define _TXB2D4_TXB2D41_POSN                                0x1
#define _TXB2D4_TXB2D41_POSITION                            0x1
#define _TXB2D4_TXB2D41_SIZE                                0x1
#define _TXB2D4_TXB2D41_LENGTH                              0x1
#define _TXB2D4_TXB2D41_MASK                                0x2
#define _TXB2D4_TXB2D42_POSN                                0x2
#define _TXB2D4_TXB2D42_POSITION                            0x2
#define _TXB2D4_TXB2D42_SIZE                                0x1
#define _TXB2D4_TXB2D42_LENGTH                              0x1
#define _TXB2D4_TXB2D42_MASK                                0x4
#define _TXB2D4_TXB2D43_POSN                                0x3
#define _TXB2D4_TXB2D43_POSITION                            0x3
#define _TXB2D4_TXB2D43_SIZE                                0x1
#define _TXB2D4_TXB2D43_LENGTH                              0x1
#define _TXB2D4_TXB2D43_MASK                                0x8
#define _TXB2D4_TXB2D44_POSN                                0x4
#define _TXB2D4_TXB2D44_POSITION                            0x4
#define _TXB2D4_TXB2D44_SIZE                                0x1
#define _TXB2D4_TXB2D44_LENGTH                              0x1
#define _TXB2D4_TXB2D44_MASK                                0x10
#define _TXB2D4_TXB2D45_POSN                                0x5
#define _TXB2D4_TXB2D45_POSITION                            0x5
#define _TXB2D4_TXB2D45_SIZE                                0x1
#define _TXB2D4_TXB2D45_LENGTH                              0x1
#define _TXB2D4_TXB2D45_MASK                                0x20
#define _TXB2D4_TXB2D46_POSN                                0x6
#define _TXB2D4_TXB2D46_POSITION                            0x6
#define _TXB2D4_TXB2D46_SIZE                                0x1
#define _TXB2D4_TXB2D46_LENGTH                              0x1
#define _TXB2D4_TXB2D46_MASK                                0x40
#define _TXB2D4_TXB2D47_POSN                                0x7
#define _TXB2D4_TXB2D47_POSITION                            0x7
#define _TXB2D4_TXB2D47_SIZE                                0x1
#define _TXB2D4_TXB2D47_LENGTH                              0x1
#define _TXB2D4_TXB2D47_MASK                                0x80

// Register: TXB2D5
#define TXB2D5 TXB2D5
extern volatile unsigned char           TXB2D5              __at(0xF2B);
#ifndef _LIB_BUILD
asm("TXB2D5 equ 0F2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D50                :1;
        unsigned TXB2D51                :1;
        unsigned TXB2D52                :1;
        unsigned TXB2D53                :1;
        unsigned TXB2D54                :1;
        unsigned TXB2D55                :1;
        unsigned TXB2D56                :1;
        unsigned TXB2D57                :1;
    };
} TXB2D5bits_t;
extern volatile TXB2D5bits_t TXB2D5bits __at(0xF2B);
// bitfield macros
#define _TXB2D5_TXB2D50_POSN                                0x0
#define _TXB2D5_TXB2D50_POSITION                            0x0
#define _TXB2D5_TXB2D50_SIZE                                0x1
#define _TXB2D5_TXB2D50_LENGTH                              0x1
#define _TXB2D5_TXB2D50_MASK                                0x1
#define _TXB2D5_TXB2D51_POSN                                0x1
#define _TXB2D5_TXB2D51_POSITION                            0x1
#define _TXB2D5_TXB2D51_SIZE                                0x1
#define _TXB2D5_TXB2D51_LENGTH                              0x1
#define _TXB2D5_TXB2D51_MASK                                0x2
#define _TXB2D5_TXB2D52_POSN                                0x2
#define _TXB2D5_TXB2D52_POSITION                            0x2
#define _TXB2D5_TXB2D52_SIZE                                0x1
#define _TXB2D5_TXB2D52_LENGTH                              0x1
#define _TXB2D5_TXB2D52_MASK                                0x4
#define _TXB2D5_TXB2D53_POSN                                0x3
#define _TXB2D5_TXB2D53_POSITION                            0x3
#define _TXB2D5_TXB2D53_SIZE                                0x1
#define _TXB2D5_TXB2D53_LENGTH                              0x1
#define _TXB2D5_TXB2D53_MASK                                0x8
#define _TXB2D5_TXB2D54_POSN                                0x4
#define _TXB2D5_TXB2D54_POSITION                            0x4
#define _TXB2D5_TXB2D54_SIZE                                0x1
#define _TXB2D5_TXB2D54_LENGTH                              0x1
#define _TXB2D5_TXB2D54_MASK                                0x10
#define _TXB2D5_TXB2D55_POSN                                0x5
#define _TXB2D5_TXB2D55_POSITION                            0x5
#define _TXB2D5_TXB2D55_SIZE                                0x1
#define _TXB2D5_TXB2D55_LENGTH                              0x1
#define _TXB2D5_TXB2D55_MASK                                0x20
#define _TXB2D5_TXB2D56_POSN                                0x6
#define _TXB2D5_TXB2D56_POSITION                            0x6
#define _TXB2D5_TXB2D56_SIZE                                0x1
#define _TXB2D5_TXB2D56_LENGTH                              0x1
#define _TXB2D5_TXB2D56_MASK                                0x40
#define _TXB2D5_TXB2D57_POSN                                0x7
#define _TXB2D5_TXB2D57_POSITION                            0x7
#define _TXB2D5_TXB2D57_SIZE                                0x1
#define _TXB2D5_TXB2D57_LENGTH                              0x1
#define _TXB2D5_TXB2D57_MASK                                0x80

// Register: TXB2D6
#define TXB2D6 TXB2D6
extern volatile unsigned char           TXB2D6              __at(0xF2C);
#ifndef _LIB_BUILD
asm("TXB2D6 equ 0F2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D60                :1;
        unsigned TXB2D61                :1;
        unsigned TXB2D62                :1;
        unsigned TXB2D63                :1;
        unsigned TXB2D64                :1;
        unsigned TXB2D65                :1;
        unsigned TXB2D66                :1;
        unsigned TXB2D67                :1;
    };
} TXB2D6bits_t;
extern volatile TXB2D6bits_t TXB2D6bits __at(0xF2C);
// bitfield macros
#define _TXB2D6_TXB2D60_POSN                                0x0
#define _TXB2D6_TXB2D60_POSITION                            0x0
#define _TXB2D6_TXB2D60_SIZE                                0x1
#define _TXB2D6_TXB2D60_LENGTH                              0x1
#define _TXB2D6_TXB2D60_MASK                                0x1
#define _TXB2D6_TXB2D61_POSN                                0x1
#define _TXB2D6_TXB2D61_POSITION                            0x1
#define _TXB2D6_TXB2D61_SIZE                                0x1
#define _TXB2D6_TXB2D61_LENGTH                              0x1
#define _TXB2D6_TXB2D61_MASK                                0x2
#define _TXB2D6_TXB2D62_POSN                                0x2
#define _TXB2D6_TXB2D62_POSITION                            0x2
#define _TXB2D6_TXB2D62_SIZE                                0x1
#define _TXB2D6_TXB2D62_LENGTH                              0x1
#define _TXB2D6_TXB2D62_MASK                                0x4
#define _TXB2D6_TXB2D63_POSN                                0x3
#define _TXB2D6_TXB2D63_POSITION                            0x3
#define _TXB2D6_TXB2D63_SIZE                                0x1
#define _TXB2D6_TXB2D63_LENGTH                              0x1
#define _TXB2D6_TXB2D63_MASK                                0x8
#define _TXB2D6_TXB2D64_POSN                                0x4
#define _TXB2D6_TXB2D64_POSITION                            0x4
#define _TXB2D6_TXB2D64_SIZE                                0x1
#define _TXB2D6_TXB2D64_LENGTH                              0x1
#define _TXB2D6_TXB2D64_MASK                                0x10
#define _TXB2D6_TXB2D65_POSN                                0x5
#define _TXB2D6_TXB2D65_POSITION                            0x5
#define _TXB2D6_TXB2D65_SIZE                                0x1
#define _TXB2D6_TXB2D65_LENGTH                              0x1
#define _TXB2D6_TXB2D65_MASK                                0x20
#define _TXB2D6_TXB2D66_POSN                                0x6
#define _TXB2D6_TXB2D66_POSITION                            0x6
#define _TXB2D6_TXB2D66_SIZE                                0x1
#define _TXB2D6_TXB2D66_LENGTH                              0x1
#define _TXB2D6_TXB2D66_MASK                                0x40
#define _TXB2D6_TXB2D67_POSN                                0x7
#define _TXB2D6_TXB2D67_POSITION                            0x7
#define _TXB2D6_TXB2D67_SIZE                                0x1
#define _TXB2D6_TXB2D67_LENGTH                              0x1
#define _TXB2D6_TXB2D67_MASK                                0x80

// Register: TXB2D7
#define TXB2D7 TXB2D7
extern volatile unsigned char           TXB2D7              __at(0xF2D);
#ifndef _LIB_BUILD
asm("TXB2D7 equ 0F2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D70                :1;
        unsigned TXB2D71                :1;
        unsigned TXB2D72                :1;
        unsigned TXB2D73                :1;
        unsigned TXB2D74                :1;
        unsigned TXB2D75                :1;
        unsigned TXB2D76                :1;
        unsigned TXB2D77                :1;
    };
} TXB2D7bits_t;
