MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2480/mcu.h
extern volatile RXB1D7bits_t RXB1D7bits __at(0xF5D);
// bitfield macros
#define _RXB1D7_RXB1D70_POSN                                0x0
#define _RXB1D7_RXB1D70_POSITION                            0x0
#define _RXB1D7_RXB1D70_SIZE                                0x1
#define _RXB1D7_RXB1D70_LENGTH                              0x1
#define _RXB1D7_RXB1D70_MASK                                0x1
#define _RXB1D7_RXB1D71_POSN                                0x1
#define _RXB1D7_RXB1D71_POSITION                            0x1
#define _RXB1D7_RXB1D71_SIZE                                0x1
#define _RXB1D7_RXB1D71_LENGTH                              0x1
#define _RXB1D7_RXB1D71_MASK                                0x2
#define _RXB1D7_RXB1D72_POSN                                0x2
#define _RXB1D7_RXB1D72_POSITION                            0x2
#define _RXB1D7_RXB1D72_SIZE                                0x1
#define _RXB1D7_RXB1D72_LENGTH                              0x1
#define _RXB1D7_RXB1D72_MASK                                0x4
#define _RXB1D7_RXB1D73_POSN                                0x3
#define _RXB1D7_RXB1D73_POSITION                            0x3
#define _RXB1D7_RXB1D73_SIZE                                0x1
#define _RXB1D7_RXB1D73_LENGTH                              0x1
#define _RXB1D7_RXB1D73_MASK                                0x8
#define _RXB1D7_RXB1D74_POSN                                0x4
#define _RXB1D7_RXB1D74_POSITION                            0x4
#define _RXB1D7_RXB1D74_SIZE                                0x1
#define _RXB1D7_RXB1D74_LENGTH                              0x1
#define _RXB1D7_RXB1D74_MASK                                0x10
#define _RXB1D7_RXB1D75_POSN                                0x5
#define _RXB1D7_RXB1D75_POSITION                            0x5
#define _RXB1D7_RXB1D75_SIZE                                0x1
#define _RXB1D7_RXB1D75_LENGTH                              0x1
#define _RXB1D7_RXB1D75_MASK                                0x20
#define _RXB1D7_RXB1D76_POSN                                0x6
#define _RXB1D7_RXB1D76_POSITION                            0x6
#define _RXB1D7_RXB1D76_SIZE                                0x1
#define _RXB1D7_RXB1D76_LENGTH                              0x1
#define _RXB1D7_RXB1D76_MASK                                0x40
#define _RXB1D7_RXB1D77_POSN                                0x7
#define _RXB1D7_RXB1D77_POSITION                            0x7
#define _RXB1D7_RXB1D77_SIZE                                0x1
#define _RXB1D7_RXB1D77_LENGTH                              0x1
#define _RXB1D7_RXB1D77_MASK                                0x80

// Register: CANSTAT_RO0
#define CANSTAT_RO0 CANSTAT_RO0
extern volatile unsigned char           CANSTAT_RO0         __at(0xF5E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO0 equ 0F5Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned ICODE3                 :1;
        unsigned ICODE4                 :1;
    };
} CANSTAT_RO0bits_t;
extern volatile CANSTAT_RO0bits_t CANSTAT_RO0bits __at(0xF5E);
// bitfield macros
#define _CANSTAT_RO0_EICODE0_POSN                           0x0
#define _CANSTAT_RO0_EICODE0_POSITION                       0x0
#define _CANSTAT_RO0_EICODE0_SIZE                           0x1
#define _CANSTAT_RO0_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO0_EICODE0_MASK                           0x1
#define _CANSTAT_RO0_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO0_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO0_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO0_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO0_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO0_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO0_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO0_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO0_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO0_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO0_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO0_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO0_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO0_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO0_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO0_EICODE4_POSN                           0x4
#define _CANSTAT_RO0_EICODE4_POSITION                       0x4
#define _CANSTAT_RO0_EICODE4_SIZE                           0x1
#define _CANSTAT_RO0_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO0_EICODE4_MASK                           0x10
#define _CANSTAT_RO0_OPMODE0_POSN                           0x5
#define _CANSTAT_RO0_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO0_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO0_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO0_OPMODE0_MASK                           0x20
#define _CANSTAT_RO0_OPMODE1_POSN                           0x6
#define _CANSTAT_RO0_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO0_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO0_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO0_OPMODE1_MASK                           0x40
#define _CANSTAT_RO0_OPMODE2_POSN                           0x7
#define _CANSTAT_RO0_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO0_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO0_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO0_OPMODE2_MASK                           0x80
#define _CANSTAT_RO0_ICODE0_POSN                            0x0
#define _CANSTAT_RO0_ICODE0_POSITION                        0x0
#define _CANSTAT_RO0_ICODE0_SIZE                            0x1
#define _CANSTAT_RO0_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO0_ICODE0_MASK                            0x1
#define _CANSTAT_RO0_ICODE1_POSN                            0x1
#define _CANSTAT_RO0_ICODE1_POSITION                        0x1
#define _CANSTAT_RO0_ICODE1_SIZE                            0x1
#define _CANSTAT_RO0_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO0_ICODE1_MASK                            0x2
#define _CANSTAT_RO0_ICODE2_POSN                            0x2
#define _CANSTAT_RO0_ICODE2_POSITION                        0x2
#define _CANSTAT_RO0_ICODE2_SIZE                            0x1
#define _CANSTAT_RO0_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO0_ICODE2_MASK                            0x4
#define _CANSTAT_RO0_ICODE3_POSN                            0x3
#define _CANSTAT_RO0_ICODE3_POSITION                        0x3
#define _CANSTAT_RO0_ICODE3_SIZE                            0x1
#define _CANSTAT_RO0_ICODE3_LENGTH                          0x1
#define _CANSTAT_RO0_ICODE3_MASK                            0x8
#define _CANSTAT_RO0_ICODE4_POSN                            0x4
#define _CANSTAT_RO0_ICODE4_POSITION                        0x4
#define _CANSTAT_RO0_ICODE4_SIZE                            0x1
#define _CANSTAT_RO0_ICODE4_LENGTH                          0x1
#define _CANSTAT_RO0_ICODE4_MASK                            0x10

// Register: CANCON_RO0
#define CANCON_RO0 CANCON_RO0
extern volatile unsigned char           CANCON_RO0          __at(0xF5F);
#ifndef _LIB_BUILD
asm("CANCON_RO0 equ 0F5Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP0                 :1;
        unsigned REQOP1                 :1;
        unsigned REQOP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
} CANCON_RO0bits_t;
extern volatile CANCON_RO0bits_t CANCON_RO0bits __at(0xF5F);
// bitfield macros
#define _CANCON_RO0_FP0_POSN                                0x0
#define _CANCON_RO0_FP0_POSITION                            0x0
#define _CANCON_RO0_FP0_SIZE                                0x1
#define _CANCON_RO0_FP0_LENGTH                              0x1
#define _CANCON_RO0_FP0_MASK                                0x1
#define _CANCON_RO0_WIN0_FP1_POSN                           0x1
#define _CANCON_RO0_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO0_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO0_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO0_WIN0_FP1_MASK                           0x2
#define _CANCON_RO0_WIN1_FP2_POSN                           0x2
#define _CANCON_RO0_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO0_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO0_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO0_WIN1_FP2_MASK                           0x4
#define _CANCON_RO0_WIN2_FP3_POSN                           0x3
#define _CANCON_RO0_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO0_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO0_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO0_WIN2_FP3_MASK                           0x8
#define _CANCON_RO0_ABAT_POSN                               0x4
#define _CANCON_RO0_ABAT_POSITION                           0x4
#define _CANCON_RO0_ABAT_SIZE                               0x1
#define _CANCON_RO0_ABAT_LENGTH                             0x1
#define _CANCON_RO0_ABAT_MASK                               0x10
#define _CANCON_RO0_REQOP0_POSN                             0x5
#define _CANCON_RO0_REQOP0_POSITION                         0x5
#define _CANCON_RO0_REQOP0_SIZE                             0x1
#define _CANCON_RO0_REQOP0_LENGTH                           0x1
#define _CANCON_RO0_REQOP0_MASK                             0x20
#define _CANCON_RO0_REQOP1_POSN                             0x6
#define _CANCON_RO0_REQOP1_POSITION                         0x6
#define _CANCON_RO0_REQOP1_SIZE                             0x1
#define _CANCON_RO0_REQOP1_LENGTH                           0x1
#define _CANCON_RO0_REQOP1_MASK                             0x40
#define _CANCON_RO0_REQOP2_POSN                             0x7
#define _CANCON_RO0_REQOP2_POSITION                         0x7
#define _CANCON_RO0_REQOP2_SIZE                             0x1
#define _CANCON_RO0_REQOP2_LENGTH                           0x1
#define _CANCON_RO0_REQOP2_MASK                             0x80
#define _CANCON_RO0_WIN0_POSN                               0x1
#define _CANCON_RO0_WIN0_POSITION                           0x1
#define _CANCON_RO0_WIN0_SIZE                               0x1
#define _CANCON_RO0_WIN0_LENGTH                             0x1
#define _CANCON_RO0_WIN0_MASK                               0x2
#define _CANCON_RO0_WIN1_POSN                               0x2
#define _CANCON_RO0_WIN1_POSITION                           0x2
#define _CANCON_RO0_WIN1_SIZE                               0x1
#define _CANCON_RO0_WIN1_LENGTH                             0x1
#define _CANCON_RO0_WIN1_MASK                               0x4
#define _CANCON_RO0_WIN2_POSN                               0x3
#define _CANCON_RO0_WIN2_POSITION                           0x3
#define _CANCON_RO0_WIN2_SIZE                               0x1
#define _CANCON_RO0_WIN2_LENGTH                             0x1
#define _CANCON_RO0_WIN2_MASK                               0x8

// Register: RXB0CON
#define RXB0CON RXB0CON
extern volatile unsigned char           RXB0CON             __at(0xF60);
#ifndef _LIB_BUILD
asm("RXB0CON equ 0F60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FILHIT0                :1;
        unsigned JTOFF_FILHIT1          :1;
        unsigned RXB0DBEN_FILHIT2       :1;
        unsigned RXRTRRO_FILHIT3        :1;
        unsigned FILHIT4                :1;
        unsigned RXM0_RTRRO             :1;
        unsigned RXM1                   :1;
        unsigned RXFUL                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned JTOFF                  :1;
        unsigned RXB0DBEN               :1;
        unsigned RXRTRRO                :1;
        unsigned                        :1;
        unsigned RXM0                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned FILHIT1                :1;
        unsigned FILHIT2                :1;
        unsigned FILHIT3                :1;
        unsigned                        :1;
        unsigned RTRRO                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned RXBODBEN               :1;
    };
    struct {
        unsigned RXB0FILHIT0            :1;
        unsigned RXB0FILHIT1            :1;
        unsigned RXB0FILHIT2            :1;
        unsigned RXB0FILHIT3            :1;
        unsigned RXB0FILHIT4            :1;
        unsigned RXB0M0                 :1;
        unsigned RXB0M1                 :1;
        unsigned RXB0FUL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RXB0RTRR0              :1;
        unsigned                        :1;
        unsigned RXB0RTRRO              :1;
    };
} RXB0CONbits_t;
