MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2480/mcu.h
#define                                 B2EID5_bit          _BIT_ACCESS(B2EIDL,5)
// B2EIDL<B2EID6>
extern volatile __bit                   B2EID6              __at(0x7226);	// @ (0xE44 * 8 + 6)
#define                                 B2EID6_bit          _BIT_ACCESS(B2EIDL,6)
// B2EIDL<B2EID7>
extern volatile __bit                   B2EID7              __at(0x7227);	// @ (0xE44 * 8 + 7)
#define                                 B2EID7_bit          _BIT_ACCESS(B2EIDL,7)
// B2EIDH<B2EID8>
extern volatile __bit                   B2EID8              __at(0x7218);	// @ (0xE43 * 8 + 0)
#define                                 B2EID8_bit          _BIT_ACCESS(B2EIDH,0)
// B2EIDH<B2EID9>
extern volatile __bit                   B2EID9              __at(0x7219);	// @ (0xE43 * 8 + 1)
#define                                 B2EID9_bit          _BIT_ACCESS(B2EIDH,1)
// B2SIDL<B2EXID>
extern volatile __bit                   B2EXID              __at(0x7213);	// @ (0xE42 * 8 + 3)
#define                                 B2EXID_bit          _BIT_ACCESS(B2SIDL,3)
// B2SIDL<B2EXIDE>
extern volatile __bit                   B2EXIDE             __at(0x7213);	// @ (0xE42 * 8 + 3)
#define                                 B2EXIDE_bit         _BIT_ACCESS(B2SIDL,3)
// B2CON<B2FILHIT0>
extern volatile __bit                   B2FILHIT0           __at(0x7200);	// @ (0xE40 * 8 + 0)
#define                                 B2FILHIT0_bit       _BIT_ACCESS(B2CON,0)
// B2CON<B2FILHIT1>
extern volatile __bit                   B2FILHIT1           __at(0x7201);	// @ (0xE40 * 8 + 1)
#define                                 B2FILHIT1_bit       _BIT_ACCESS(B2CON,1)
// B2CON<B2FILHIT2>
extern volatile __bit                   B2FILHIT2           __at(0x7202);	// @ (0xE40 * 8 + 2)
#define                                 B2FILHIT2_bit       _BIT_ACCESS(B2CON,2)
// B2CON<B2FILHIT3>
extern volatile __bit                   B2FILHIT3           __at(0x7203);	// @ (0xE40 * 8 + 3)
#define                                 B2FILHIT3_bit       _BIT_ACCESS(B2CON,3)
// B2CON<B2FILHIT4>
extern volatile __bit                   B2FILHIT4           __at(0x7204);	// @ (0xE40 * 8 + 4)
#define                                 B2FILHIT4_bit       _BIT_ACCESS(B2CON,4)
// BIE0<B2IE>
extern volatile __bit                   B2IE                __at(0x6FD4);	// @ (0xDFA * 8 + 4)
#define                                 B2IE_bit            _BIT_ACCESS(BIE0,4)
// B2DLC<B2RB0>
extern volatile __bit                   B2RB0               __at(0x722C);	// @ (0xE45 * 8 + 4)
#define                                 B2RB0_bit           _BIT_ACCESS(B2DLC,4)
// B2DLC<B2RB1>
extern volatile __bit                   B2RB1               __at(0x722D);	// @ (0xE45 * 8 + 5)
#define                                 B2RB1_bit           _BIT_ACCESS(B2DLC,5)
// B2CON<B2RTREN>
extern volatile __bit                   B2RTREN             __at(0x7202);	// @ (0xE40 * 8 + 2)
#define                                 B2RTREN_bit         _BIT_ACCESS(B2CON,2)
// B2CON<B2RTRRO>
extern volatile __bit                   B2RTRRO             __at(0x7205);	// @ (0xE40 * 8 + 5)
#define                                 B2RTRRO_bit         _BIT_ACCESS(B2CON,5)
// B2CON<B2RXFUL>
extern volatile __bit                   B2RXFUL             __at(0x7207);	// @ (0xE40 * 8 + 7)
#define                                 B2RXFUL_bit         _BIT_ACCESS(B2CON,7)
// B2CON<B2RXM1>
extern volatile __bit                   B2RXM1              __at(0x7206);	// @ (0xE40 * 8 + 6)
#define                                 B2RXM1_bit          _BIT_ACCESS(B2CON,6)
// B2DLC<B2RXRTR>
extern volatile __bit                   B2RXRTR             __at(0x722E);	// @ (0xE45 * 8 + 6)
#define                                 B2RXRTR_bit         _BIT_ACCESS(B2DLC,6)
// B2SIDL<B2SID0>
extern volatile __bit                   B2SID0              __at(0x7215);	// @ (0xE42 * 8 + 5)
#define                                 B2SID0_bit          _BIT_ACCESS(B2SIDL,5)
// B2SIDL<B2SID1>
extern volatile __bit                   B2SID1              __at(0x7216);	// @ (0xE42 * 8 + 6)
#define                                 B2SID1_bit          _BIT_ACCESS(B2SIDL,6)
// B2SIDH<B2SID10>
extern volatile __bit                   B2SID10             __at(0x720F);	// @ (0xE41 * 8 + 7)
#define                                 B2SID10_bit         _BIT_ACCESS(B2SIDH,7)
// B2SIDL<B2SID2>
extern volatile __bit                   B2SID2              __at(0x7217);	// @ (0xE42 * 8 + 7)
#define                                 B2SID2_bit          _BIT_ACCESS(B2SIDL,7)
// B2SIDH<B2SID3>
extern volatile __bit                   B2SID3              __at(0x7208);	// @ (0xE41 * 8 + 0)
#define                                 B2SID3_bit          _BIT_ACCESS(B2SIDH,0)
// B2SIDH<B2SID4>
extern volatile __bit                   B2SID4              __at(0x7209);	// @ (0xE41 * 8 + 1)
#define                                 B2SID4_bit          _BIT_ACCESS(B2SIDH,1)
// B2SIDH<B2SID5>
extern volatile __bit                   B2SID5              __at(0x720A);	// @ (0xE41 * 8 + 2)
#define                                 B2SID5_bit          _BIT_ACCESS(B2SIDH,2)
// B2SIDH<B2SID6>
extern volatile __bit                   B2SID6              __at(0x720B);	// @ (0xE41 * 8 + 3)
#define                                 B2SID6_bit          _BIT_ACCESS(B2SIDH,3)
// B2SIDH<B2SID7>
extern volatile __bit                   B2SID7              __at(0x720C);	// @ (0xE41 * 8 + 4)
#define                                 B2SID7_bit          _BIT_ACCESS(B2SIDH,4)
// B2SIDH<B2SID8>
extern volatile __bit                   B2SID8              __at(0x720D);	// @ (0xE41 * 8 + 5)
#define                                 B2SID8_bit          _BIT_ACCESS(B2SIDH,5)
// B2SIDH<B2SID9>
extern volatile __bit                   B2SID9              __at(0x720E);	// @ (0xE41 * 8 + 6)
#define                                 B2SID9_bit          _BIT_ACCESS(B2SIDH,6)
// B2SIDL<B2SRR>
extern volatile __bit                   B2SRR               __at(0x7214);	// @ (0xE42 * 8 + 4)
#define                                 B2SRR_bit           _BIT_ACCESS(B2SIDL,4)
// B2CON<B2TXABT>
extern volatile __bit                   B2TXABT             __at(0x7206);	// @ (0xE40 * 8 + 6)
#define                                 B2TXABT_bit         _BIT_ACCESS(B2CON,6)
// B2CON<B2TXB3IF>
extern volatile __bit                   B2TXB3IF            __at(0x7207);	// @ (0xE40 * 8 + 7)
#define                                 B2TXB3IF_bit        _BIT_ACCESS(B2CON,7)
// BSEL0<B2TXEN>
extern volatile __bit                   B2TXEN              __at(0x6FC4);	// @ (0xDF8 * 8 + 4)
#define                                 B2TXEN_bit          _BIT_ACCESS(BSEL0,4)
// B2CON<B2TXERR>
extern volatile __bit                   B2TXERR             __at(0x7204);	// @ (0xE40 * 8 + 4)
#define                                 B2TXERR_bit         _BIT_ACCESS(B2CON,4)
// B2CON<B2TXLARB>
extern volatile __bit                   B2TXLARB            __at(0x7205);	// @ (0xE40 * 8 + 5)
#define                                 B2TXLARB_bit        _BIT_ACCESS(B2CON,5)
// B2CON<B2TXPRI0>
extern volatile __bit                   B2TXPRI0            __at(0x7200);	// @ (0xE40 * 8 + 0)
#define                                 B2TXPRI0_bit        _BIT_ACCESS(B2CON,0)
// B2CON<B2TXPRI1>
extern volatile __bit                   B2TXPRI1            __at(0x7201);	// @ (0xE40 * 8 + 1)
#define                                 B2TXPRI1_bit        _BIT_ACCESS(B2CON,1)
// B2CON<B2TXREQ>
extern volatile __bit                   B2TXREQ             __at(0x7203);	// @ (0xE40 * 8 + 3)
#define                                 B2TXREQ_bit         _BIT_ACCESS(B2CON,3)
// B3D0<B3D00>
extern volatile __bit                   B3D00               __at(0x72B0);	// @ (0xE56 * 8 + 0)
#define                                 B3D00_bit           _BIT_ACCESS(B3D0,0)
// B3D0<B3D01>
extern volatile __bit                   B3D01               __at(0x72B1);	// @ (0xE56 * 8 + 1)
#define                                 B3D01_bit           _BIT_ACCESS(B3D0,1)
// B3D0<B3D02>
extern volatile __bit                   B3D02               __at(0x72B2);	// @ (0xE56 * 8 + 2)
#define                                 B3D02_bit           _BIT_ACCESS(B3D0,2)
// B3D0<B3D03>
extern volatile __bit                   B3D03               __at(0x72B3);	// @ (0xE56 * 8 + 3)
#define                                 B3D03_bit           _BIT_ACCESS(B3D0,3)
// B3D0<B3D04>
extern volatile __bit                   B3D04               __at(0x72B4);	// @ (0xE56 * 8 + 4)
#define                                 B3D04_bit           _BIT_ACCESS(B3D0,4)
// B3D0<B3D05>
extern volatile __bit                   B3D05               __at(0x72B5);	// @ (0xE56 * 8 + 5)
#define                                 B3D05_bit           _BIT_ACCESS(B3D0,5)
// B3D0<B3D06>
extern volatile __bit                   B3D06               __at(0x72B6);	// @ (0xE56 * 8 + 6)
#define                                 B3D06_bit           _BIT_ACCESS(B3D0,6)
// B3D0<B3D07>
extern volatile __bit                   B3D07               __at(0x72B7);	// @ (0xE56 * 8 + 7)
#define                                 B3D07_bit           _BIT_ACCESS(B3D0,7)
// B3D1<B3D10>
extern volatile __bit                   B3D10               __at(0x72B8);	// @ (0xE57 * 8 + 0)
#define                                 B3D10_bit           _BIT_ACCESS(B3D1,0)
// B3D1<B3D11>
extern volatile __bit                   B3D11               __at(0x72B9);	// @ (0xE57 * 8 + 1)
#define                                 B3D11_bit           _BIT_ACCESS(B3D1,1)
// B3D1<B3D12>
extern volatile __bit                   B3D12               __at(0x72BA);	// @ (0xE57 * 8 + 2)
#define                                 B3D12_bit           _BIT_ACCESS(B3D1,2)
// B3D1<B3D13>
extern volatile __bit                   B3D13               __at(0x72BB);	// @ (0xE57 * 8 + 3)
#define                                 B3D13_bit           _BIT_ACCESS(B3D1,3)
// B3D1<B3D14>
extern volatile __bit                   B3D14               __at(0x72BC);	// @ (0xE57 * 8 + 4)
#define                                 B3D14_bit           _BIT_ACCESS(B3D1,4)
// B3D1<B3D15>
extern volatile __bit                   B3D15               __at(0x72BD);	// @ (0xE57 * 8 + 5)
#define                                 B3D15_bit           _BIT_ACCESS(B3D1,5)
// B3D1<B3D16>
extern volatile __bit                   B3D16               __at(0x72BE);	// @ (0xE57 * 8 + 6)
#define                                 B3D16_bit           _BIT_ACCESS(B3D1,6)
// B3D1<B3D17>
extern volatile __bit                   B3D17               __at(0x72BF);	// @ (0xE57 * 8 + 7)
#define                                 B3D17_bit           _BIT_ACCESS(B3D1,7)
// B3D2<B3D20>
extern volatile __bit                   B3D20               __at(0x72C0);	// @ (0xE58 * 8 + 0)
#define                                 B3D20_bit           _BIT_ACCESS(B3D2,0)
// B3D2<B3D21>
extern volatile __bit                   B3D21               __at(0x72C1);	// @ (0xE58 * 8 + 1)
#define                                 B3D21_bit           _BIT_ACCESS(B3D2,1)
// B3D2<B3D22>
extern volatile __bit                   B3D22               __at(0x72C2);	// @ (0xE58 * 8 + 2)
#define                                 B3D22_bit           _BIT_ACCESS(B3D2,2)
// B3D2<B3D23>
extern volatile __bit                   B3D23               __at(0x72C3);	// @ (0xE58 * 8 + 3)
#define                                 B3D23_bit           _BIT_ACCESS(B3D2,3)
// B3D2<B3D24>
extern volatile __bit                   B3D24               __at(0x72C4);	// @ (0xE58 * 8 + 4)
#define                                 B3D24_bit           _BIT_ACCESS(B3D2,4)
// B3D2<B3D25>
extern volatile __bit                   B3D25               __at(0x72C5);	// @ (0xE58 * 8 + 5)
#define                                 B3D25_bit           _BIT_ACCESS(B3D2,5)
// B3D2<B3D26>
extern volatile __bit                   B3D26               __at(0x72C6);	// @ (0xE58 * 8 + 6)
#define                                 B3D26_bit           _BIT_ACCESS(B3D2,6)
// B3D2<B3D27>
extern volatile __bit                   B3D27               __at(0x72C7);	// @ (0xE58 * 8 + 7)
#define                                 B3D27_bit           _BIT_ACCESS(B3D2,7)
// B3D3<B3D30>
extern volatile __bit                   B3D30               __at(0x72C8);	// @ (0xE59 * 8 + 0)
#define                                 B3D30_bit           _BIT_ACCESS(B3D3,0)
// B3D3<B3D31>
extern volatile __bit                   B3D31               __at(0x72C9);	// @ (0xE59 * 8 + 1)
#define                                 B3D31_bit           _BIT_ACCESS(B3D3,1)
// B3D3<B3D32>
extern volatile __bit                   B3D32               __at(0x72CA);	// @ (0xE59 * 8 + 2)
#define                                 B3D32_bit           _BIT_ACCESS(B3D3,2)
// B3D3<B3D33>
extern volatile __bit                   B3D33               __at(0x72CB);	// @ (0xE59 * 8 + 3)
#define                                 B3D33_bit           _BIT_ACCESS(B3D3,3)
// B3D3<B3D34>
extern volatile __bit                   B3D34               __at(0x72CC);	// @ (0xE59 * 8 + 4)
#define                                 B3D34_bit           _BIT_ACCESS(B3D3,4)
// B3D3<B3D35>
extern volatile __bit                   B3D35               __at(0x72CD);	// @ (0xE59 * 8 + 5)
#define                                 B3D35_bit           _BIT_ACCESS(B3D3,5)
// B3D3<B3D36>
extern volatile __bit                   B3D36               __at(0x72CE);	// @ (0xE59 * 8 + 6)
#define                                 B3D36_bit           _BIT_ACCESS(B3D3,6)
// B3D3<B3D37>
extern volatile __bit                   B3D37               __at(0x72CF);	// @ (0xE59 * 8 + 7)
#define                                 B3D37_bit           _BIT_ACCESS(B3D3,7)
// B3D4<B3D40>
extern volatile __bit                   B3D40               __at(0x72D0);	// @ (0xE5A * 8 + 0)
#define                                 B3D40_bit           _BIT_ACCESS(B3D4,0)
// B3D4<B3D41>
extern volatile __bit                   B3D41               __at(0x72D1);	// @ (0xE5A * 8 + 1)
#define                                 B3D41_bit           _BIT_ACCESS(B3D4,1)
// B3D4<B3D42>
extern volatile __bit                   B3D42               __at(0x72D2);	// @ (0xE5A * 8 + 2)
#define                                 B3D42_bit           _BIT_ACCESS(B3D4,2)
// B3D4<B3D43>
extern volatile __bit                   B3D43               __at(0x72D3);	// @ (0xE5A * 8 + 3)
#define                                 B3D43_bit           _BIT_ACCESS(B3D4,3)
// B3D4<B3D44>
extern volatile __bit                   B3D44               __at(0x72D4);	// @ (0xE5A * 8 + 4)
#define                                 B3D44_bit           _BIT_ACCESS(B3D4,4)
// B3D4<B3D45>
extern volatile __bit                   B3D45               __at(0x72D5);	// @ (0xE5A * 8 + 5)
#define                                 B3D45_bit           _BIT_ACCESS(B3D4,5)
// B3D4<B3D46>
extern volatile __bit                   B3D46               __at(0x72D6);	// @ (0xE5A * 8 + 6)
#define                                 B3D46_bit           _BIT_ACCESS(B3D4,6)
// B3D4<B3D47>
extern volatile __bit                   B3D47               __at(0x72D7);	// @ (0xE5A * 8 + 7)
#define                                 B3D47_bit           _BIT_ACCESS(B3D4,7)
// B3D5<B3D50>
extern volatile __bit                   B3D50               __at(0x72D8);	// @ (0xE5B * 8 + 0)
#define                                 B3D50_bit           _BIT_ACCESS(B3D5,0)
// B3D5<B3D51>
extern volatile __bit                   B3D51               __at(0x72D9);	// @ (0xE5B * 8 + 1)
#define                                 B3D51_bit           _BIT_ACCESS(B3D5,1)
// B3D5<B3D52>
extern volatile __bit                   B3D52               __at(0x72DA);	// @ (0xE5B * 8 + 2)
#define                                 B3D52_bit           _BIT_ACCESS(B3D5,2)
// B3D5<B3D53>
extern volatile __bit                   B3D53               __at(0x72DB);	// @ (0xE5B * 8 + 3)
#define                                 B3D53_bit           _BIT_ACCESS(B3D5,3)
// B3D5<B3D54>
extern volatile __bit                   B3D54               __at(0x72DC);	// @ (0xE5B * 8 + 4)
#define                                 B3D54_bit           _BIT_ACCESS(B3D5,4)
// B3D5<B3D55>
extern volatile __bit                   B3D55               __at(0x72DD);	// @ (0xE5B * 8 + 5)
#define                                 B3D55_bit           _BIT_ACCESS(B3D5,5)
// B3D5<B3D56>
extern volatile __bit                   B3D56               __at(0x72DE);	// @ (0xE5B * 8 + 6)
#define                                 B3D56_bit           _BIT_ACCESS(B3D5,6)
// B3D5<B3D57>
extern volatile __bit                   B3D57               __at(0x72DF);	// @ (0xE5B * 8 + 7)
#define                                 B3D57_bit           _BIT_ACCESS(B3D5,7)
// B3D6<B3D60>
extern volatile __bit                   B3D60               __at(0x72E0);	// @ (0xE5C * 8 + 0)
#define                                 B3D60_bit           _BIT_ACCESS(B3D6,0)
// B3D6<B3D61>
extern volatile __bit                   B3D61               __at(0x72E1);	// @ (0xE5C * 8 + 1)
#define                                 B3D61_bit           _BIT_ACCESS(B3D6,1)
// B3D6<B3D62>
extern volatile __bit                   B3D62               __at(0x72E2);	// @ (0xE5C * 8 + 2)
#define                                 B3D62_bit           _BIT_ACCESS(B3D6,2)
// B3D6<B3D63>
extern volatile __bit                   B3D63               __at(0x72E3);	// @ (0xE5C * 8 + 3)
#define                                 B3D63_bit           _BIT_ACCESS(B3D6,3)
// B3D6<B3D64>
extern volatile __bit                   B3D64               __at(0x72E4);	// @ (0xE5C * 8 + 4)
#define                                 B3D64_bit           _BIT_ACCESS(B3D6,4)
// B3D6<B3D65>
extern volatile __bit                   B3D65               __at(0x72E5);	// @ (0xE5C * 8 + 5)
#define                                 B3D65_bit           _BIT_ACCESS(B3D6,5)
// B3D6<B3D66>
extern volatile __bit                   B3D66               __at(0x72E6);	// @ (0xE5C * 8 + 6)
#define                                 B3D66_bit           _BIT_ACCESS(B3D6,6)
// B3D6<B3D67>
extern volatile __bit                   B3D67               __at(0x72E7);	// @ (0xE5C * 8 + 7)
#define                                 B3D67_bit           _BIT_ACCESS(B3D6,7)
// B3D7<B3D70>
extern volatile __bit                   B3D70               __at(0x72E8);	// @ (0xE5D * 8 + 0)
#define                                 B3D70_bit           _BIT_ACCESS(B3D7,0)
// B3D7<B3D71>
extern volatile __bit                   B3D71               __at(0x72E9);	// @ (0xE5D * 8 + 1)
#define                                 B3D71_bit           _BIT_ACCESS(B3D7,1)
// B3D7<B3D72>
extern volatile __bit                   B3D72               __at(0x72EA);	// @ (0xE5D * 8 + 2)
#define                                 B3D72_bit           _BIT_ACCESS(B3D7,2)
// B3D7<B3D73>
extern volatile __bit                   B3D73               __at(0x72EB);	// @ (0xE5D * 8 + 3)
#define                                 B3D73_bit           _BIT_ACCESS(B3D7,3)
// B3D7<B3D74>
extern volatile __bit                   B3D74               __at(0x72EC);	// @ (0xE5D * 8 + 4)
#define                                 B3D74_bit           _BIT_ACCESS(B3D7,4)
// B3D7<B3D75>
extern volatile __bit                   B3D75               __at(0x72ED);	// @ (0xE5D * 8 + 5)
#define                                 B3D75_bit           _BIT_ACCESS(B3D7,5)
// B3D7<B3D76>
extern volatile __bit                   B3D76               __at(0x72EE);	// @ (0xE5D * 8 + 6)
#define                                 B3D76_bit           _BIT_ACCESS(B3D7,6)
// B3D7<B3D77>
extern volatile __bit                   B3D77               __at(0x72EF);	// @ (0xE5D * 8 + 7)
#define                                 B3D77_bit           _BIT_ACCESS(B3D7,7)
// B3DLC<B3DLC0>
extern volatile __bit                   B3DLC0              __at(0x72A8);	// @ (0xE55 * 8 + 0)
#define                                 B3DLC0_bit          _BIT_ACCESS(B3DLC,0)
// B3DLC<B3DLC1>
extern volatile __bit                   B3DLC1              __at(0x72A9);	// @ (0xE55 * 8 + 1)
#define                                 B3DLC1_bit          _BIT_ACCESS(B3DLC,1)
// B3DLC<B3DLC2>
extern volatile __bit                   B3DLC2              __at(0x72AA);	// @ (0xE55 * 8 + 2)
#define                                 B3DLC2_bit          _BIT_ACCESS(B3DLC,2)
// B3DLC<B3DLC3>
extern volatile __bit                   B3DLC3              __at(0x72AB);	// @ (0xE55 * 8 + 3)
#define                                 B3DLC3_bit          _BIT_ACCESS(B3DLC,3)
// B3EIDL<B3EID0>
extern volatile __bit                   B3EID0              __at(0x72A0);	// @ (0xE54 * 8 + 0)
#define                                 B3EID0_bit          _BIT_ACCESS(B3EIDL,0)
// B3EIDL<B3EID1>
extern volatile __bit                   B3EID1              __at(0x72A1);	// @ (0xE54 * 8 + 1)
#define                                 B3EID1_bit          _BIT_ACCESS(B3EIDL,1)
// B3EIDH<B3EID10>
extern volatile __bit                   B3EID10             __at(0x729A);	// @ (0xE53 * 8 + 2)
#define                                 B3EID10_bit         _BIT_ACCESS(B3EIDH,2)
// B3EIDH<B3EID11>
extern volatile __bit                   B3EID11             __at(0x729B);	// @ (0xE53 * 8 + 3)
#define                                 B3EID11_bit         _BIT_ACCESS(B3EIDH,3)
// B3EIDH<B3EID12>
extern volatile __bit                   B3EID12             __at(0x729C);	// @ (0xE53 * 8 + 4)
#define                                 B3EID12_bit         _BIT_ACCESS(B3EIDH,4)
// B3EIDH<B3EID13>
extern volatile __bit                   B3EID13             __at(0x729D);	// @ (0xE53 * 8 + 5)
#define                                 B3EID13_bit         _BIT_ACCESS(B3EIDH,5)
// B3EIDH<B3EID14>
extern volatile __bit                   B3EID14             __at(0x729E);	// @ (0xE53 * 8 + 6)
#define                                 B3EID14_bit         _BIT_ACCESS(B3EIDH,6)
// B3EIDH<B3EID15>
extern volatile __bit                   B3EID15             __at(0x729F);	// @ (0xE53 * 8 + 7)
#define                                 B3EID15_bit         _BIT_ACCESS(B3EIDH,7)
// B3SIDL<B3EID16>
extern volatile __bit                   B3EID16             __at(0x7290);	// @ (0xE52 * 8 + 0)
#define                                 B3EID16_bit         _BIT_ACCESS(B3SIDL,0)
// B3SIDL<B3EID17>
extern volatile __bit                   B3EID17             __at(0x7291);	// @ (0xE52 * 8 + 1)
#define                                 B3EID17_bit         _BIT_ACCESS(B3SIDL,1)
// B3EIDL<B3EID2>
extern volatile __bit                   B3EID2              __at(0x72A2);	// @ (0xE54 * 8 + 2)
#define                                 B3EID2_bit          _BIT_ACCESS(B3EIDL,2)
// B3EIDL<B3EID3>
extern volatile __bit                   B3EID3              __at(0x72A3);	// @ (0xE54 * 8 + 3)
#define                                 B3EID3_bit          _BIT_ACCESS(B3EIDL,3)
// B3EIDL<B3EID4>
extern volatile __bit                   B3EID4              __at(0x72A4);	// @ (0xE54 * 8 + 4)
#define                                 B3EID4_bit          _BIT_ACCESS(B3EIDL,4)
// B3EIDL<B3EID5>
extern volatile __bit                   B3EID5              __at(0x72A5);	// @ (0xE54 * 8 + 5)
#define                                 B3EID5_bit          _BIT_ACCESS(B3EIDL,5)
// B3EIDL<B3EID6>
extern volatile __bit                   B3EID6              __at(0x72A6);	// @ (0xE54 * 8 + 6)
#define                                 B3EID6_bit          _BIT_ACCESS(B3EIDL,6)
// B3EIDL<B3EID7>
extern volatile __bit                   B3EID7              __at(0x72A7);	// @ (0xE54 * 8 + 7)
#define                                 B3EID7_bit          _BIT_ACCESS(B3EIDL,7)
// B3EIDH<B3EID8>
extern volatile __bit                   B3EID8              __at(0x7298);	// @ (0xE53 * 8 + 0)
#define                                 B3EID8_bit          _BIT_ACCESS(B3EIDH,0)
// B3EIDH<B3EID9>
