MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2480/mcu.h
extern volatile __bit                   B5FILHIT1           __at(0x7381);	// @ (0xE70 * 8 + 1)
#define                                 B5FILHIT1_bit       _BIT_ACCESS(B5CON,1)
// B5CON<B5FILHIT2>
extern volatile __bit                   B5FILHIT2           __at(0x7382);	// @ (0xE70 * 8 + 2)
#define                                 B5FILHIT2_bit       _BIT_ACCESS(B5CON,2)
// B5CON<B5FILHIT3>
extern volatile __bit                   B5FILHIT3           __at(0x7383);	// @ (0xE70 * 8 + 3)
#define                                 B5FILHIT3_bit       _BIT_ACCESS(B5CON,3)
// B5CON<B5FILHIT4>
extern volatile __bit                   B5FILHIT4           __at(0x7384);	// @ (0xE70 * 8 + 4)
#define                                 B5FILHIT4_bit       _BIT_ACCESS(B5CON,4)
// BIE0<B5IE>
extern volatile __bit                   B5IE                __at(0x6FD7);	// @ (0xDFA * 8 + 7)
#define                                 B5IE_bit            _BIT_ACCESS(BIE0,7)
// B5DLC<B5RB0>
extern volatile __bit                   B5RB0               __at(0x73AC);	// @ (0xE75 * 8 + 4)
#define                                 B5RB0_bit           _BIT_ACCESS(B5DLC,4)
// B5DLC<B5RB1>
extern volatile __bit                   B5RB1               __at(0x73AD);	// @ (0xE75 * 8 + 5)
#define                                 B5RB1_bit           _BIT_ACCESS(B5DLC,5)
// B5CON<B5RTREN>
extern volatile __bit                   B5RTREN             __at(0x7382);	// @ (0xE70 * 8 + 2)
#define                                 B5RTREN_bit         _BIT_ACCESS(B5CON,2)
// B5CON<B5RTRRO>
extern volatile __bit                   B5RTRRO             __at(0x7385);	// @ (0xE70 * 8 + 5)
#define                                 B5RTRRO_bit         _BIT_ACCESS(B5CON,5)
// B5CON<B5RXFUL>
extern volatile __bit                   B5RXFUL             __at(0x7387);	// @ (0xE70 * 8 + 7)
#define                                 B5RXFUL_bit         _BIT_ACCESS(B5CON,7)
// B5CON<B5RXM1>
extern volatile __bit                   B5RXM1              __at(0x7386);	// @ (0xE70 * 8 + 6)
#define                                 B5RXM1_bit          _BIT_ACCESS(B5CON,6)
// B5DLC<B5RXRTR>
extern volatile __bit                   B5RXRTR             __at(0x73AE);	// @ (0xE75 * 8 + 6)
#define                                 B5RXRTR_bit         _BIT_ACCESS(B5DLC,6)
// B5SIDL<B5SID0>
extern volatile __bit                   B5SID0              __at(0x7395);	// @ (0xE72 * 8 + 5)
#define                                 B5SID0_bit          _BIT_ACCESS(B5SIDL,5)
// B5SIDL<B5SID1>
extern volatile __bit                   B5SID1              __at(0x7396);	// @ (0xE72 * 8 + 6)
#define                                 B5SID1_bit          _BIT_ACCESS(B5SIDL,6)
// B5SIDH<B5SID10>
extern volatile __bit                   B5SID10             __at(0x738F);	// @ (0xE71 * 8 + 7)
#define                                 B5SID10_bit         _BIT_ACCESS(B5SIDH,7)
// B5SIDL<B5SID2>
extern volatile __bit                   B5SID2              __at(0x7397);	// @ (0xE72 * 8 + 7)
#define                                 B5SID2_bit          _BIT_ACCESS(B5SIDL,7)
// B5SIDH<B5SID3>
extern volatile __bit                   B5SID3              __at(0x7388);	// @ (0xE71 * 8 + 0)
#define                                 B5SID3_bit          _BIT_ACCESS(B5SIDH,0)
// B5SIDH<B5SID4>
extern volatile __bit                   B5SID4              __at(0x7389);	// @ (0xE71 * 8 + 1)
#define                                 B5SID4_bit          _BIT_ACCESS(B5SIDH,1)
// B5SIDH<B5SID5>
extern volatile __bit                   B5SID5              __at(0x738A);	// @ (0xE71 * 8 + 2)
#define                                 B5SID5_bit          _BIT_ACCESS(B5SIDH,2)
// B5SIDH<B5SID6>
extern volatile __bit                   B5SID6              __at(0x738B);	// @ (0xE71 * 8 + 3)
#define                                 B5SID6_bit          _BIT_ACCESS(B5SIDH,3)
// B5SIDH<B5SID7>
extern volatile __bit                   B5SID7              __at(0x738C);	// @ (0xE71 * 8 + 4)
#define                                 B5SID7_bit          _BIT_ACCESS(B5SIDH,4)
// B5SIDH<B5SID8>
extern volatile __bit                   B5SID8              __at(0x738D);	// @ (0xE71 * 8 + 5)
#define                                 B5SID8_bit          _BIT_ACCESS(B5SIDH,5)
// B5SIDH<B5SID9>
extern volatile __bit                   B5SID9              __at(0x738E);	// @ (0xE71 * 8 + 6)
#define                                 B5SID9_bit          _BIT_ACCESS(B5SIDH,6)
// B5SIDL<B5SRR>
extern volatile __bit                   B5SRR               __at(0x7394);	// @ (0xE72 * 8 + 4)
#define                                 B5SRR_bit           _BIT_ACCESS(B5SIDL,4)
// B5CON<B5TXABT>
extern volatile __bit                   B5TXABT             __at(0x7386);	// @ (0xE70 * 8 + 6)
#define                                 B5TXABT_bit         _BIT_ACCESS(B5CON,6)
// B5CON<B5TXBIF>
extern volatile __bit                   B5TXBIF             __at(0x7387);	// @ (0xE70 * 8 + 7)
#define                                 B5TXBIF_bit         _BIT_ACCESS(B5CON,7)
// BSEL0<B5TXEN>
extern volatile __bit                   B5TXEN              __at(0x6FC7);	// @ (0xDF8 * 8 + 7)
#define                                 B5TXEN_bit          _BIT_ACCESS(BSEL0,7)
// B5CON<B5TXERR>
extern volatile __bit                   B5TXERR             __at(0x7384);	// @ (0xE70 * 8 + 4)
#define                                 B5TXERR_bit         _BIT_ACCESS(B5CON,4)
// B5CON<B5TXLARB>
extern volatile __bit                   B5TXLARB            __at(0x7385);	// @ (0xE70 * 8 + 5)
#define                                 B5TXLARB_bit        _BIT_ACCESS(B5CON,5)
// B5CON<B5TXPRI0>
extern volatile __bit                   B5TXPRI0            __at(0x7380);	// @ (0xE70 * 8 + 0)
#define                                 B5TXPRI0_bit        _BIT_ACCESS(B5CON,0)
// B5CON<B5TXPRI1>
extern volatile __bit                   B5TXPRI1            __at(0x7381);	// @ (0xE70 * 8 + 1)
#define                                 B5TXPRI1_bit        _BIT_ACCESS(B5CON,1)
// B5CON<B5TXREQ>
extern volatile __bit                   B5TXREQ             __at(0x7383);	// @ (0xE70 * 8 + 3)
#define                                 B5TXREQ_bit         _BIT_ACCESS(B5CON,3)
// PIE2<BCLIE>
extern volatile __bit                   BCLIE               __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCLIE_bit           _BIT_ACCESS(PIE2,3)
// PIR2<BCLIF>
extern volatile __bit                   BCLIF               __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCLIF_bit           _BIT_ACCESS(PIR2,3)
// IPR2<BCLIP>
extern volatile __bit                   BCLIP               __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCLIP_bit           _BIT_ACCESS(IPR2,3)
// SSPSTAT<BF>
extern volatile __bit                   BF                  __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSPSTAT,0)
// HLVDCON<BGST>
extern volatile __bit                   BGST                __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 BGST_bit            _BIT_ACCESS(HLVDCON,5)
// RCON<BOR>
extern volatile __bit                   BOR                 __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(RCON,0)
// BAUDCON<BRG16>
extern volatile __bit                   BRG16               __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 BRG16_bit           _BIT_ACCESS(BAUDCON,3)
// TXSTA<BRGH>
extern volatile __bit                   BRGH                __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TXSTA,2)
// TXSTA<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TXSTA,2)
// BRGCON1<BRP0>
extern volatile __bit                   BRP0                __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 BRP0_bit            _BIT_ACCESS(BRGCON1,0)
// BRGCON1<BRP1>
extern volatile __bit                   BRP1                __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 BRP1_bit            _BIT_ACCESS(BRGCON1,1)
// BRGCON1<BRP2>
extern volatile __bit                   BRP2                __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 BRP2_bit            _BIT_ACCESS(BRGCON1,2)
// BRGCON1<BRP3>
extern volatile __bit                   BRP3                __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 BRP3_bit            _BIT_ACCESS(BRGCON1,3)
// BRGCON1<BRP4>
extern volatile __bit                   BRP4                __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 BRP4_bit            _BIT_ACCESS(BRGCON1,4)
// BRGCON1<BRP5>
extern volatile __bit                   BRP5                __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 BRP5_bit            _BIT_ACCESS(BRGCON1,5)
// CIOCON<CANCAP>
extern volatile __bit                   CANCAP              __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 CANCAP_bit          _BIT_ACCESS(CIOCON,4)
// PORTB<CANRX>
extern volatile __bit                   CANRX               __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CANRX_bit           _BIT_ACCESS(PORTB,3)
// PORTB<CANTX>
extern volatile __bit                   CANTX               __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 CANTX_bit           _BIT_ACCESS(PORTB,2)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PORTC<CCP1>
extern volatile __bit                   CCP1                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CCP1_bit            _BIT_ACCESS(PORTC,2)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// EECON1<CFGS>
extern volatile __bit                   CFGS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// PORTC<CK>
extern volatile __bit                   CK                  __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK_bit              _BIT_ACCESS(PORTC,6)
// SSPSTAT<CKE>
extern volatile __bit                   CKE                 __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSPSTAT,6)
// SSPCON1<CKP>
extern volatile __bit                   CKP                 __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSPCON1,4)
// PORTA<CLKI>
extern volatile __bit                   CLKI                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 CLKI_bit            _BIT_ACCESS(PORTA,7)
// PORTA<CLKO>
extern volatile __bit                   CLKO                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 CLKO_bit            _BIT_ACCESS(PORTA,6)
// RCSTA<CREN>
extern volatile __bit                   CREN                __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA,4)
// TXSTA<CSRC>
extern volatile __bit                   CSRC                __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA,7)
// TXSTA<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA,7)
// PORTA<CVREF>
extern volatile __bit                   CVREF               __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 CVREF_bit           _BIT_ACCESS(PORTA,0)
// PORTA<CVREFA>
extern volatile __bit                   CVREFA              __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 CVREFA_bit          _BIT_ACCESS(PORTA,0)
// SSPSTAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSPSTAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// SDFLC<DFLC0>
extern volatile __bit                   DFLC0               __at(0x6EC0);	// @ (0xDD8 * 8 + 0)
#define                                 DFLC0_bit           _BIT_ACCESS(SDFLC,0)
// SDFLC<DFLC1>
extern volatile __bit                   DFLC1               __at(0x6EC1);	// @ (0xDD8 * 8 + 1)
#define                                 DFLC1_bit           _BIT_ACCESS(SDFLC,1)
// SDFLC<DFLC2>
extern volatile __bit                   DFLC2               __at(0x6EC2);	// @ (0xDD8 * 8 + 2)
#define                                 DFLC2_bit           _BIT_ACCESS(SDFLC,2)
// SDFLC<DFLC3>
extern volatile __bit                   DFLC3               __at(0x6EC3);	// @ (0xDD8 * 8 + 3)
#define                                 DFLC3_bit           _BIT_ACCESS(SDFLC,3)
// SDFLC<DFLC4>
extern volatile __bit                   DFLC4               __at(0x6EC4);	// @ (0xDD8 * 8 + 4)
#define                                 DFLC4_bit           _BIT_ACCESS(SDFLC,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,1)
// BIE0<DRXB0IE>
extern volatile __bit                   DRXB0IE             __at(0x6FD0);	// @ (0xDFA * 8 + 0)
#define                                 DRXB0IE_bit         _BIT_ACCESS(BIE0,0)
// BIE0<DRXB1IE>
extern volatile __bit                   DRXB1IE             __at(0x6FD1);	// @ (0xDFA * 8 + 1)
#define                                 DRXB1IE_bit         _BIT_ACCESS(BIE0,1)
// PORTC<DT>
extern volatile __bit                   DT                  __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 DT_bit              _BIT_ACCESS(PORTC,7)
// SSPSTAT<D_A>
extern volatile __bit                   D_A                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_A_bit             _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<D_NOT_A>
extern volatile __bit                   D_NOT_A             __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_NOT_A_bit         _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<D_nA>
extern volatile __bit                   D_nA                __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSPSTAT,5)
// PR2<EBDIS>
extern volatile __bit                   EBDIS               __at(0x7E5F);	// @ (0xFCB * 8 + 7)
#define                                 EBDIS_bit           _BIT_ACCESS(_PR2,7)  // Note: Changed by MikroE
// EECON1<EEFS>
extern volatile __bit                   EEFS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 EEFS_bit            _BIT_ACCESS(EECON1,6)
// PIE2<EEIE>
extern volatile __bit                   EEIE                __at(0x7D04);	// @ (0xFA0 * 8 + 4)
#define                                 EEIE_bit            _BIT_ACCESS(PIE2,4)
// PIR2<EEIF>
extern volatile __bit                   EEIF                __at(0x7D0C);	// @ (0xFA1 * 8 + 4)
#define                                 EEIF_bit            _BIT_ACCESS(PIR2,4)
// IPR2<EEIP>
extern volatile __bit                   EEIP                __at(0x7D14);	// @ (0xFA2 * 8 + 4)
#define                                 EEIP_bit            _BIT_ACCESS(IPR2,4)
// EECON1<EEPGD>
extern volatile __bit                   EEPGD               __at(0x7D37);	// @ (0xFA6 * 8 + 7)
#define                                 EEPGD_bit           _BIT_ACCESS(EECON1,7)
// CANSTAT<EICODE1>
extern volatile __bit                   EICODE1             __at(0x7B71);	// @ (0xF6E * 8 + 1)
#define                                 EICODE1_bit         _BIT_ACCESS(CANSTAT,1)
// CANSTAT<EICODE2>
extern volatile __bit                   EICODE2             __at(0x7B72);	// @ (0xF6E * 8 + 2)
#define                                 EICODE2_bit         _BIT_ACCESS(CANSTAT,2)
// CANSTAT<EICODE3>
extern volatile __bit                   EICODE3             __at(0x7B73);	// @ (0xF6E * 8 + 3)
#define                                 EICODE3_bit         _BIT_ACCESS(CANSTAT,3)
// CIOCON<ENDRHI>
extern volatile __bit                   ENDRHI              __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 ENDRHI_bit          _BIT_ACCESS(CIOCON,5)
// PIE3<ERRIE>
extern volatile __bit                   ERRIE               __at(0x7D1D);	// @ (0xFA3 * 8 + 5)
#define                                 ERRIE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<ERRIF>
extern volatile __bit                   ERRIF               __at(0x7D25);	// @ (0xFA4 * 8 + 5)
#define                                 ERRIF_bit           _BIT_ACCESS(PIR3,5)
// IPR3<ERRIP>
extern volatile __bit                   ERRIP               __at(0x7D2D);	// @ (0xFA5 * 8 + 5)
#define                                 ERRIP_bit           _BIT_ACCESS(IPR3,5)
// COMSTAT<EWARN>
extern volatile __bit                   EWARN               __at(0x7BA0);	// @ (0xF74 * 8 + 0)
#define                                 EWARN_bit           _BIT_ACCESS(COMSTAT,0)
// ECANCON<EWIN0>
extern volatile __bit                   EWIN0               __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 EWIN0_bit           _BIT_ACCESS(ECANCON,0)
// ECANCON<EWIN1>
extern volatile __bit                   EWIN1               __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 EWIN1_bit           _BIT_ACCESS(ECANCON,1)
// ECANCON<EWIN2>
extern volatile __bit                   EWIN2               __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 EWIN2_bit           _BIT_ACCESS(ECANCON,2)
// ECANCON<EWIN3>
extern volatile __bit                   EWIN3               __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 EWIN3_bit           _BIT_ACCESS(ECANCON,3)
// ECANCON<EWIN4>
extern volatile __bit                   EWIN4               __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 EWIN4_bit           _BIT_ACCESS(ECANCON,4)
// RXFBCON0<F0BP_0>
extern volatile __bit                   F0BP_0              __at(0x6F00);	// @ (0xDE0 * 8 + 0)
#define                                 F0BP_0_bit          _BIT_ACCESS(RXFBCON0,0)
// RXFBCON0<F0BP_01>
extern volatile __bit                   F0BP_01             __at(0x6F00);	// @ (0xDE0 * 8 + 0)
#define                                 F0BP_01_bit         _BIT_ACCESS(RXFBCON0,0)
// RXFBCON0<F0BP_1>
extern volatile __bit                   F0BP_1              __at(0x6F01);	// @ (0xDE0 * 8 + 1)
#define                                 F0BP_1_bit          _BIT_ACCESS(RXFBCON0,1)
// RXFBCON0<F0BP_2>
extern volatile __bit                   F0BP_2              __at(0x6F02);	// @ (0xDE0 * 8 + 2)
#define                                 F0BP_2_bit          _BIT_ACCESS(RXFBCON0,2)
// RXFBCON0<F0BP_3>
extern volatile __bit                   F0BP_3              __at(0x6F03);	// @ (0xDE0 * 8 + 3)
#define                                 F0BP_3_bit          _BIT_ACCESS(RXFBCON0,3)
// RXFBCON5<F10BP_0>
extern volatile __bit                   F10BP_0             __at(0x6F28);	// @ (0xDE5 * 8 + 0)
#define                                 F10BP_0_bit         _BIT_ACCESS(RXFBCON5,0)
// RXFBCON5<F10BP_01>
extern volatile __bit                   F10BP_01            __at(0x6F28);	// @ (0xDE5 * 8 + 0)
#define                                 F10BP_01_bit        _BIT_ACCESS(RXFBCON5,0)
// RXFBCON5<F10BP_1>
extern volatile __bit                   F10BP_1             __at(0x6F29);	// @ (0xDE5 * 8 + 1)
#define                                 F10BP_1_bit         _BIT_ACCESS(RXFBCON5,1)
// RXFBCON5<F10BP_2>
extern volatile __bit                   F10BP_2             __at(0x6F2A);	// @ (0xDE5 * 8 + 2)
#define                                 F10BP_2_bit         _BIT_ACCESS(RXFBCON5,2)
// RXFBCON5<F10BP_3>
extern volatile __bit                   F10BP_3             __at(0x6F2B);	// @ (0xDE5 * 8 + 3)
